files=($(ls ~/projects/env_error_questions/env_error_tools/db_backup))

printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
データベースを復元します。
"

printf "+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"

while true
do

i=1
for file in ${files[@]}; do
    echo "【${i}】:"${file}
    let i++
done

printf "+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"

printf "復元するファイルを番号で選んでください。下に行くほど新しいバックアップです。
中断する場合はCtrl + Cで抜けてください。
※半角で入力してください
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"

read input

if [ $files[${input}] ] ; then
  printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
$files[${input}]
を復元します..
"
mysql -u root < ~/projects/env_error_questions/env_error_tools/db_backup/$files[${input}]
  printf "
復元が完了しました
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"
  return 2>&- || exit
else
  printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
無効な番号です。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"
fi

done
