WHICHTN=`which terminal-notifier`
if [ ! `echo $WHICHTN | grep '/usr/local/bin'` ] ; then
  printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
「terminal-notifier」がインストールされていません。
homebrewで「terminal-notifier」を導入します。
これはターミナルから通知を飛ばすツールです。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"

brew install terminal-notifier
printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
「terminal-notifier」のインストールが完了しました。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"
  printf '\e[31m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
※※※「terminal-notifier」の通知を許可してください！！※※※
3秒後、Macの右上に通知が表示されるので許可を選択してください。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\e[m
'
printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
通知を許可したら「y」を入力してEnterを押してください。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"

printf "3..."
sleep 1
printf "2..."
sleep 1
printf "1..."
sleep 1
terminal-notifier -message 'このメッセージが表示されている場合、既に通知が許可されています。ターミナルでyを入力してください' -sound Glass

read input_yn
if [ $input_yn != y -a $input_yn != ｙ ] ; then
:
else
printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
「terminal-notifier」のテストを行います。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"
terminal-notifier -message '通知が表示されればOKです。' -sound Glass
fi

else

fi
