EXIT=false
printf "
【shell】:チェック中...
"
source ~/projects/env_error_questions/env_error_tools/shell_checker.sh
printf "
【shell】:チェック完了
"

if [[ $EXIT == "true" ]] ; then
  return 2>&- || exit
fi

: 'Command Line Toolsが入っているか'
printf "\e[32m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Command Line Toolsをチェックします
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\e[m
"
printf '\e[31m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
【xcode-selectコマンドを実行するには、コマンドライン・デベロッパツールが必要です】
というウインドウは表示されましたか？表示されたのであればインストールを行ってください（かなり時間がかかります）
※もしウインドウの案内どおりではインストール出来ない場合はカリキュラムの手順をお試しください。
https://master.tech-camp.in/curriculums/4415#12

【command line tools are already installed】と表示されていたり、インストールが完了した場合は
yを入力してEnterを押してください。中断する場合はy以外を入力してEnterを押してください
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\e[m
'
xcode-select --install
read xcode_install
if [ $xcode_install != y -a $xcode_install != ｙ ] ; then
  printf "\e[31m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
xcodeを導入してからやり直してください
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\e[m
"
  EXIT=true
  return 2>&- || exit
fi

printf "\e[31m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
ここからはパスワードの入力を求められたら、Macのパスワードを入力してください
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\e[m
"
sudo cd ..
: 'xcodeのライセンス認証'

printf "
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
xcodeのライセンス認証を行います
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"

sudo xcodebuild -license accept

printf "\e[32m
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
Command Line Toolsのチェックが完了しました
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
\e[m
"
